<template>
  <div >
    该系统是一个集成了深度学习技术的植物图像文字描述平台，主要功能是将用户上传的植物图像通过计算机视觉技术进行分析，然后自动生成描述该图像的文本信息。系统前端采用Vue框架和Flask框架，为用户提供直观的交互界面，包括图像上传、描述获取、用户登录和数据库查看等功能。后端服务则负责处理用户请求，调用深度学习模型，并返回所需的数据。
在图像描述功能上，系统首先使用DenseNet201网络模型对上传的植物图像进行特征提取，然后利用LSTM网络模型将这些特征转换成具有语义关联的文本描述。这个过程涉及到图像理解与自然语言生成两个深度学习领域的技术。用户可以通过系统上传植物图像，系统将调用训练好的模型进行推理，生成描述并展示给用户，从而辅助用户识别植物特征。此外，系统还包括用户数据管理、图像和描述的存储与检索等功能，增强了用户体验和系统的实用性。
  </div>
</template>

<script lang='ts' setup>
  import {RouterView,RouterLink} from 'vue-router'

</script>

<style>

</style>